In [1]:
import pandas as pd
import numpy as np

# Clean code tips

* Use list comprehension
* Use built-in functions
* Modify dataset in-place (inplace = True) instead of copying and/or reassigning dataframe

# Data Cleaning and Preparation

* ### Missing data
* ### Data transformation
* ### Data wargling
* ### Detecting and Filtering Outliers
* ### Permutation and Random Sampling
* ### Dummy Variables
* ### String Manipulation

## Missing data

### Detection

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering: drop

In [32]:
from numpy import nan as NA

data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA]])

In [33]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN

In [34]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [35]:
#drop rows that are all NA
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN

In [21]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN

In [36]:
#drop columns that are all NA
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN

In [37]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

df

          0         1         2
0 -1.044896       NaN       NaN
1  0.272755       NaN       NaN
2 -1.019250       NaN -1.770965
3  0.661124       NaN -0.287657
4  0.121134 -0.827935 -0.572115
5 -1.094071 -0.583933 -0.292649
6  0.643254 -1.317612 -0.393034

In [38]:
#Drop n number of NaN in each column
df.dropna(thresh=2)

          0         1         2
2 -1.019250       NaN -1.770965
3  0.661124       NaN -0.287657
4  0.121134 -0.827935 -0.572115
5 -1.094071 -0.583933 -0.292649
6  0.643254 -1.317612 -0.393034

### Filling in

In [39]:
df.fillna(0)

          0         1         2
0 -1.044896  0.000000  0.000000
1  0.272755  0.000000  0.000000
2 -1.019250  0.000000 -1.770965
3  0.661124  0.000000 -0.287657
4  0.121134 -0.827935 -0.572115
5 -1.094071 -0.583933 -0.292649
6  0.643254 -1.317612 -0.393034

In [40]:
#Filling each column with different values
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.044896  0.500000  0.000000
1  0.272755  0.500000  0.000000
2 -1.019250  0.500000 -1.770965
3  0.661124  0.500000 -0.287657
4  0.121134 -0.827935 -0.572115
5 -1.094071 -0.583933 -0.292649
6  0.643254 -1.317612 -0.393034

In [41]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -1.044896  0.000000  0.000000
1  0.272755  0.000000  0.000000
2 -1.019250  0.000000 -1.770965
3  0.661124  0.000000 -0.287657
4  0.121134 -0.827935 -0.572115
5 -1.094071 -0.583933 -0.292649
6  0.643254 -1.317612 -0.393034

In [42]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

df

          0         1         2
0  0.761032 -0.520704  0.152503
1  0.988059  0.284125 -0.226602
2 -0.043059       NaN  0.178040
3  0.179080       NaN -0.525620
4 -1.572992       NaN       NaN
5 -0.163953       NaN       NaN

In [43]:
df.fillna(method='ffill') #forward fill

          0         1         2
0  0.761032 -0.520704  0.152503
1  0.988059  0.284125 -0.226602
2 -0.043059  0.284125  0.178040
3  0.179080  0.284125 -0.525620
4 -1.572992  0.284125 -0.525620
5 -0.163953  0.284125 -0.525620

In [44]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.761032 -0.520704  0.152503
1  0.988059  0.284125 -0.226602
2 -0.043059  0.284125  0.178040
3  0.179080  0.284125 -0.525620
4 -1.572992       NaN -0.525620
5 -0.163953       NaN -0.525620

In [49]:
df.fillna(df.mean()) # fill each column with its mean

          0         1         2
0  0.761032 -0.520704  0.152503
1  0.988059  0.284125 -0.226602
2 -0.043059 -0.118289  0.178040
3  0.179080 -0.118289 -0.525620
4 -1.572992 -0.118289 -0.105420
5 -0.163953 -0.118289 -0.105420

## Data transformation

### Remove duplicated rows

In [50]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [51]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [52]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [53]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [54]:
data['v1'] = range(7)

**Remove duplicates of one column**

In [55]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [56]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transform data: adding data, replace values, rename axis indexes

* Adding new columns: mapping method
* Replace values
* Rename axis indexes
* Binning

In [57]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                    'Pastrami', 'corned beef', 'Bacon',
                    'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [58]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

 #### Add mapped column

In [65]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [68]:
lowercased = data['food'].str.lower()

data['animal'] = lowercased.map(meat_to_animal)

In [69]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [71]:
#Same in list comprehension
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

 ### Replace values

In [72]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

The history saving thread hit an unexpected error (OperationalError('database or disk is full')).History will not be written to the database.

In [73]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [74]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [77]:
#Replacing a list of values
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [76]:
#Using a dict
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [78]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [79]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

#### Rename Index

In [80]:
transform = lambda x: x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [81]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

#### Rename columns

In [82]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

#### Rename index and column at the same time

In [86]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'}, inplace=True)

In [87]:
data

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

### Binning

#### By specific bins

In [3]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

bins = [18, 25, 35, 60, 100]

cats = pd.cut(ages, bins)

In [4]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [5]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [6]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

#### Changing interval brackets

In [7]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

#### Adding labels

In [8]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

cats = pd.cut(ages, bins, labels = group_names)

In [9]:
cats

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

#### By integer number of bins

In [10]:
cats = pd.cut(ages, 4, precision = 2)

In [11]:
cats

[(19.96, 30.25], (19.96, 30.25], (19.96, 30.25], (19.96, 30.25], (19.96, 30.25], ..., (30.25, 40.5], (50.75, 61.0], (40.5, 50.75], (40.5, 50.75], (30.25, 40.5]]
Length: 12
Categories (4, interval[float64]): [(19.96, 30.25] < (30.25, 40.5] < (40.5, 50.75] < (50.75, 61.0]]

#### Passing own quantiles

In [12]:
pd.qcut(ages, [0, 0.1, 0.5, 0.9, 1.])

[(19.999, 21.1], (21.1, 29.0], (21.1, 29.0], (21.1, 29.0], (19.999, 21.1], ..., (29.0, 44.6], (44.6, 61.0], (44.6, 61.0], (29.0, 44.6], (29.0, 44.6]]
Length: 12
Categories (4, interval[float64]): [(19.999, 21.1] < (21.1, 29.0] < (29.0, 44.6] < (44.6, 61.0]]

### Detecting and Filtering Outliers

In [13]:
data = pd.DataFrame(np.random.randn(1000, 4))

#### By column

In [14]:
col = data[2]

In [16]:
#data > 3
col[np.abs(col) > 3]

407    3.081311
429   -3.001978
Name: 2, dtype: float64

#### By row

In [17]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
157  0.071729 -4.791738 -0.292598  0.465415
198  0.765456  0.495592  2.258701 -3.054734
389 -0.898233 -2.376046 -1.146955 -3.193421
394  3.191584 -0.620966 -0.564081 -0.233579
407 -0.875292 -1.537052  3.081311 -1.651517
429 -1.726567  0.559914 -3.001978 -0.089267
870  0.722799  0.095147  2.123622 -3.121387

#### Values outside interval

In [18]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [19]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.070690    -0.044029     0.004778     0.030566
std       0.961147     0.976654     1.030186     1.017343
min      -2.958288    -3.000000    -3.000000    -3.000000
25%      -0.723507    -0.650987    -0.682057    -0.651247
50%      -0.073189    -0.009626     0.013249    -0.006963
75%       0.589237     0.598750     0.697622     0.697018
max       3.000000     2.936428     3.000000     2.954957

#### set -1 and 1 values based on positive or negtive values

In [20]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1 -1.0  1.0 -1.0 -1.0
2  1.0  1.0  1.0 -1.0
3 -1.0  1.0  1.0  1.0
4 -1.0  1.0  1.0  1.0

### Permutation and Random Sampling

In [23]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [22]:
sampler = np.random.permutation(5)

sampler

array([2, 1, 0, 4, 3])

In [24]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15

#### Dataframe random subset

In [26]:
#without replacement (no repetition)
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15

In [28]:
#with replacement
df.sample(n=3, replace = True)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19

### Dummy Variables

In [29]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

In [30]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [31]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

#### Adding a prefix to the dummy column name

In [32]:
dummies = pd.get_dummies(df['key'], prefix='key')

df_with_dummy = df[['data1']].join(dummies)

In [33]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [34]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

#### Replace dummie value in the same column

### String Manipulation

#### split(): string to list indicating separator

In [36]:
val = 'a,b, guido'

In [37]:
val.split(',')

['a', 'b', ' guido']

#### split() + strip() to remove whitespace

In [39]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

#### join()

In [42]:
'::'.join(pieces)

'a::b::guido'

#### Locating substrings

In [43]:
'guido' in val

True

In [44]:
val.index(',')

1

In [45]:
val.find(':')

-1

In [46]:
val.count(',')

2

#### Other string object methods

In [47]:
val.count(',')

2

In [48]:
val.replace(',', '::')

'a::b:: guido'

In [49]:
val.replace(',', '')

'ab guido'

* endswith, startswith
* rfind
* lower, upper

#### Regular Expressions

In [50]:
import re

In [53]:
text = "foo bar\t baz  \tqux"

#### '/s+ ' : split one or more whitespaces and tabs

In [54]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [55]:
#Compiled regex object
regex = re.compile('\s+')

regex.split(text)

['foo', 'bar', 'baz', 'qux']

Creating a regex object with re.compile is highly recommended if you intend to
apply the same expression to many strings; doing so will save CPU cycles.

#### .findall : list of all patterns matching the regex

In [56]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [57]:
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [58]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

#### .search : returns only the first match

In [61]:
m = regex.search(text)

text[m.start():m.end()]

'dave@google.com'

#### segment each findall segment into its components: username, domain name, and domain suffix. 

To do this, put parentheses around the parts of the pattern to segment:

In [63]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

regex = re.compile(pattern, flags=re.IGNORECASE)

regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

### Vectorized String Functions in pandas

In [64]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}

In [66]:
data = pd.Series(data)

data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [67]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [68]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [69]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

* counts
* extract
* isalnum, isalpha, isdecimal, isdigit, islower, isnumeric, isupper
* lower, upper
* get
* ...
https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html

## Data Wrangling: Join, Combine, and Reshape

* ### Hierarchical Indexing
* ### Combining and Merging Datasets
* ### Reshaping and Pivoting

### Hierarchical Indexing: multiple index levels on an axis.

#### Series Hierarchical Indexing

In [79]:
data = pd.Series(np.random.randn(9), index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [80]:
data

a  1    0.221133
   2   -0.271346
   3    1.250770
b  1    0.344036
   3   -0.255123
c  1    0.478413
   2   -1.016683
d  2   -1.765063
   3   -1.201752
dtype: float64

In [81]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [82]:
data['b']

1    0.344036
3   -0.255123
dtype: float64

In [83]:
data['b':'c']

b  1    0.344036
   3   -0.255123
c  1    0.478413
   2   -1.016683
dtype: float64

In [84]:
data.loc[['b', 'd']]

b  1    0.344036
   3   -0.255123
d  2   -1.765063
   3   -1.201752
dtype: float64

In [85]:
data.loc[:, 2]

a   -0.271346
c   -1.016683
d   -1.765063
dtype: float64

#### Series multi-index to DataFrame

In [86]:
data.unstack()

          1         2         3
a  0.221133 -0.271346  1.250770
b  0.344036       NaN -0.255123
c  0.478413 -1.016683       NaN
d       NaN -1.765063 -1.201752

#### DataFrame Hierarchical Indexing

In [87]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], 
                                                    columns=[['Ohio', 'Ohio', 'Colorado'],
                                                    ['Green', 'Red', 'Green']])

In [88]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [89]:
frame.index.names = ['key1', 'key2']

frame.columns.names = ['state', 'color']

frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [90]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

#### MultiIndex object

In [92]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']], names=['state', 'color'])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

#### Reordering and Sorting Levels

In [95]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [96]:
# swaplevel takes two level numbers or names and returns a new object with the levels interchanged
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [102]:
# sort_index: sorts the data using only the values in a single level
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [104]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

#### Summary Statistics by Level

In [105]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [106]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

#### Indexing with a DataFrames columns

In [107]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1), 'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'], 'd': [0, 1, 2, 0, 1, 2, 3]})

In [108]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [112]:
#set_index: set column/s as index
frame2 = frame.set_index(['c', 'd'])

In [113]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [114]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

### Combining and Merging Datasets

In [115]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})

In [117]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [118]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

 #### merge: same column name

The keys in the result are the intersection, or the common set found in both tables.

In [116]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

 #### merge: different column name

In [119]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],'data2': range(3)})

pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

#### merge 'outer' : The outer join takes the union of the keys, combining the effect of applying both left and right joins:

In [120]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [122]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],'data2': range(5)})

In [124]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [125]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [123]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [129]:
pd.merge(df1, df2,  on='key', how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

To merge with multiple keys, pass a list of column names:

#### Merging on Index

left_index=True or right_index=True (or both) to indicate that the index should be used as the merge key

In [130]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [131]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [132]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

#### .join

In [133]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], index=['a', 'c', 'e'], columns=['Ohio', 'Nevada'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]], index=['b', 'c', 'd', 'e'], columns=['Missouri', 'Alabama'])

In [134]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [135]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [136]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [139]:
left1.join(right1, on='key', how= 'inner')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [140]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]], index=['a', 'c', 'e', 'f'], columns=['New York', 'Oregon'])

In [141]:
left2.join([right2, another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

#### Concatenating Along an Axis

In [142]:
#Arrays
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [143]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [145]:
#DataFrames
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],columns=['three', 'four'])

In [146]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [149]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [148]:
#using a dict
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [150]:
pd.concat([df1, df2], ignore_index=True)

   one  two  three  four
0  0.0  1.0    NaN   NaN
1  2.0  3.0    NaN   NaN
2  4.0  5.0    NaN   NaN
3  NaN  NaN    5.0   6.0
4  NaN  NaN    7.0   8.0

#### Combining Data with Overlap

When two datasets whose indexes overlap in full or part.

In [152]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],'b': [np.nan, 2., np.nan, 6.],'c': range(2, 18, 4)})
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],'b': [np.nan, 3., 4., 6., 8.]})

In [153]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [154]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [155]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

### Reshaping and Pivoting

In [158]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)), index=pd.Index(['Ohio', 'Colorado'], 
                                                                 name='state'), 
                                                    columns=pd.Index(['one', 'two', 'three'], 
                                                                     name='number'))

In [159]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

#### stack method: pivot column into rows making a Series

In [163]:
result = data.stack()

In [164]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

#### unstack method

In [165]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [168]:
#unstack selecting a level
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [169]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5